rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_ERM.h
/*
** ###################################################################
**     Processor:           S32K37_M7
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32K37 RM Rev.3
**     Version:             rev. 2.0, 2024-03-28
**     Build:               b240328
**
**     Abstract:
**         Peripheral Access Layer for S32K37_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K37_ERM.h
 * @version 2.0
 * @date 2024-03-28
 * @brief Peripheral Access Layer for S32K37_ERM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K37_ERM_H_)  /* Check if memory map has not been already included */
#define S32K37_ERM_H_

#include "S32K37_COMMON.h"

/* ----------------------------------------------------------------------------
   -- ERM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ERM_Peripheral_Access_Layer ERM Peripheral Access Layer
 * @{
 */

/** ERM - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR0;                               /**< ERM Configuration Register 0, offset: 0x0 */
  __IO uint32_t CR1;                               /**< ERM Configuration Register 1, offset: 0x4 */
  __IO uint32_t CR2;                               /**< ERM Configuration Register 2, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __IO uint32_t SR0;                               /**< ERM Status Register 0, offset: 0x10 */
  __IO uint32_t SR1;                               /**< ERM Status Register 1, offset: 0x14 */
  __IO uint32_t SR2;                               /**< ERM Status Register 2, offset: 0x18 */
  uint8_t RESERVED_1[228];
  __I  uint32_t EAR0;                              /**< ERM Memory 0 Error Address Register, offset: 0x100, available only on: ERM_0 (missing on ERM_1) */
  __I  uint32_t SYN0;                              /**< ERM Memory 0 Syndrome Register, offset: 0x104, available only on: ERM_0 (missing on ERM_1) */
  __IO uint32_t CORR_ERR_CNT0;                     /**< ERM Memory 0 Correctable Error Count Register, offset: 0x108, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_2[4];
  __I  uint32_t EAR1;                              /**< ERM Memory 1 Error Address Register, offset: 0x110, available only on: ERM_0 (missing on ERM_1) */
  __I  uint32_t SYN1;                              /**< ERM Memory 1 Syndrome Register, offset: 0x114, available only on: ERM_0 (missing on ERM_1) */
  __IO uint32_t CORR_ERR_CNT1;                     /**< ERM Memory 1 Correctable Error Count Register, offset: 0x118, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_3[12];
  __IO uint32_t CORR_ERR_CNT2;                     /**< ERM Memory 2 Correctable Error Count Register, offset: 0x128 */
  uint8_t RESERVED_4[12];
  __IO uint32_t CORR_ERR_CNT3;                     /**< ERM Memory 3 Correctable Error Count Register, offset: 0x138 */
  uint8_t RESERVED_5[12];
  __IO uint32_t CORR_ERR_CNT4;                     /**< ERM Memory 4 Correctable Error Count Register, offset: 0x148 */
  uint8_t RESERVED_6[12];
  __IO uint32_t CORR_ERR_CNT5;                     /**< ERM Memory 5 Correctable Error Count Register, offset: 0x158 */
  uint8_t RESERVED_7[12];
  __IO uint32_t CORR_ERR_CNT6;                     /**< ERM Memory 6 Correctable Error Count Register, offset: 0x168, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_8[12];
  __IO uint32_t CORR_ERR_CNT7;                     /**< ERM Memory 7 Correctable Error Count Register, offset: 0x178, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_9[12];
  __IO uint32_t CORR_ERR_CNT8;                     /**< ERM Memory 8 Correctable Error Count Register, offset: 0x188, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_10[12];
  __IO uint32_t CORR_ERR_CNT9;                     /**< ERM Memory 9 Correctable Error Count Register, offset: 0x198, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_11[4];
  __I  uint32_t EAR10;                             /**< ERM Memory 10 Error Address Register, offset: 0x1A0 */
  __I  uint32_t SYN10;                             /**< ERM Memory 10 Syndrome Register, offset: 0x1A4 */
  __IO uint32_t CORR_ERR_CNT10;                    /**< ERM Memory 10 Correctable Error Count Register, offset: 0x1A8 */
  uint8_t RESERVED_12[4];
  __I  uint32_t EAR11;                             /**< ERM Memory 11 Error Address Register, offset: 0x1B0 */
  __I  uint32_t SYN11;                             /**< ERM Memory 11 Syndrome Register, offset: 0x1B4 */
  __IO uint32_t CORR_ERR_CNT11;                    /**< ERM Memory 11 Correctable Error Count Register, offset: 0x1B8 */
  uint8_t RESERVED_13[4];
  __I  uint32_t EAR12;                             /**< ERM Memory 12 Error Address Register, offset: 0x1C0 */
  __I  uint32_t SYN12;                             /**< ERM Memory 12 Syndrome Register, offset: 0x1C4 */
  __IO uint32_t CORR_ERR_CNT12;                    /**< ERM Memory 12 Correctable Error Count Register, offset: 0x1C8 */
  uint8_t RESERVED_14[4];
  __I  uint32_t EAR13;                             /**< ERM Memory 13 Error Address Register, offset: 0x1D0, available only on: ERM_0 (missing on ERM_1) */
  __I  uint32_t SYN13;                             /**< ERM Memory 13 Syndrome Register, offset: 0x1D4, available only on: ERM_0 (missing on ERM_1) */
  __IO uint32_t CORR_ERR_CNT13;                    /**< ERM Memory 13 Correctable Error Count Register, offset: 0x1D8, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_15[4];
  __I  uint32_t EAR14;                             /**< ERM Memory 14 Error Address Register, offset: 0x1E0, available only on: ERM_0 (missing on ERM_1) */
  __I  uint32_t SYN14;                             /**< ERM Memory 14 Syndrome Register, offset: 0x1E4, available only on: ERM_0 (missing on ERM_1) */
  __IO uint32_t CORR_ERR_CNT14;                    /**< ERM Memory 14 Correctable Error Count Register, offset: 0x1E8, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_16[4];
  __I  uint32_t EAR15;                             /**< ERM Memory 15 Error Address Register, offset: 0x1F0, available only on: ERM_0 (missing on ERM_1) */
  __I  uint32_t SYN15;                             /**< ERM Memory 15 Syndrome Register, offset: 0x1F4, available only on: ERM_0 (missing on ERM_1) */
  __IO uint32_t CORR_ERR_CNT15;                    /**< ERM Memory 15 Correctable Error Count Register, offset: 0x1F8, available only on: ERM_0 (missing on ERM_1) */
  uint8_t RESERVED_17[4];
  __I  uint32_t EAR16;                             /**< ERM Memory 16 Error Address Register, offset: 0x200 */
  __I  uint32_t SYN16;                             /**< ERM Memory 16 Syndrome Register, offset: 0x204 */
  __IO uint32_t CORR_ERR_CNT16;                    /**< ERM Memory 16 Correctable Error Count Register, offset: 0x208 */
  uint8_t RESERVED_18[4];
  __I  uint32_t EAR17;                             /**< ERM Memory 17 Error Address Register, offset: 0x210 */
  uint8_t RESERVED_19[4];
  __IO uint32_t CORR_ERR_CNT17;                    /**< ERM Memory 17 Correctable Error Count Register, offset: 0x218 */
  uint8_t RESERVED_20[4];
  __I  uint32_t EAR18;                             /**< ERM Memory 18 Error Address Register, offset: 0x220 */
  __I  uint32_t SYN18;                             /**< ERM Memory 18 Syndrome Register, offset: 0x224, available only on: ERM_1 (missing on ERM_0) */
  __IO uint32_t CORR_ERR_CNT18;                    /**< ERM Memory 18 Correctable Error Count Register, offset: 0x228 */
  uint8_t RESERVED_21[4];
  __I  uint32_t EAR19;                             /**< ERM Memory 19 Error Address Register, offset: 0x230 */
  __I  uint32_t SYN19;                             /**< ERM Memory 19 Syndrome Register, offset: 0x234, available only on: ERM_1 (missing on ERM_0) */
  __IO uint32_t CORR_ERR_CNT19;                    /**< ERM Memory 19 Correctable Error Count Register, offset: 0x238 */
  uint8_t RESERVED_22[4];
  __I  uint32_t EAR20;                             /**< ERM Memory 20 Error Address Register, offset: 0x240, available only on: ERM_1 (missing on ERM_0) */
  __I  uint32_t SYN20;                             /**< ERM Memory 20 Syndrome Register, offset: 0x244, available only on: ERM_1 (missing on ERM_0) */
  __IO uint32_t CORR_ERR_CNT20;                    /**< ERM Memory 20 Correctable Error Count Register, offset: 0x248, available only on: ERM_1 (missing on ERM_0) */
  uint8_t RESERVED_23[4];
  __I  uint32_t EAR21;                             /**< ERM Memory 21 Error Address Register, offset: 0x250, available only on: ERM_1 (missing on ERM_0) */
  __I  uint32_t SYN21;                             /**< ERM Memory 21 Syndrome Register, offset: 0x254, available only on: ERM_1 (missing on ERM_0) */
  __IO uint32_t CORR_ERR_CNT21;                    /**< ERM Memory 21 Correctable Error Count Register, offset: 0x258, available only on: ERM_1 (missing on ERM_0) */
  uint8_t RESERVED_24[4];
  __I  uint32_t EAR22;                             /**< ERM Memory 22 Error Address Register, offset: 0x260, available only on: ERM_1 (missing on ERM_0) */
  __I  uint32_t SYN22;                             /**< ERM Memory 22 Syndrome Register, offset: 0x264, available only on: ERM_1 (missing on ERM_0) */
  __IO uint32_t CORR_ERR_CNT22;                    /**< ERM Memory 22 Correctable Error Count Register, offset: 0x268, available only on: ERM_1 (missing on ERM_0) */
  uint8_t RESERVED_25[4];
  __I  uint32_t EAR23;                             /**< ERM Memory 23 Error Address Register, offset: 0x270, available only on: ERM_1 (missing on ERM_0) */
  __I  uint32_t SYN23;                             /**< ERM Memory 23 Syndrome Register, offset: 0x274, available only on: ERM_1 (missing on ERM_0) */
  __IO uint32_t CORR_ERR_CNT23;                    /**< ERM Memory 23 Correctable Error Count Register, offset: 0x278, available only on: ERM_1 (missing on ERM_0) */
} ERM_Type, *ERM_MemMapPtr;

/** Number of instances of the ERM module. */
#define ERM_INSTANCE_COUNT                       (2u)

/* ERM - Peripheral instance base addresses */
/** Peripheral ERM_0 base address */
#define IP_ERM_0_BASE                            (0x4025C000u)
/** Peripheral ERM_0 base pointer */
#define IP_ERM_0                                 ((ERM_Type *)IP_ERM_0_BASE)
/** Peripheral ERM_1 base address */
#define IP_ERM_1_BASE                            (0x4000C000u)
/** Peripheral ERM_1 base pointer */
#define IP_ERM_1                                 ((ERM_Type *)IP_ERM_1_BASE)
/** Array initializer of ERM peripheral base addresses */
#define IP_ERM_BASE_ADDRS                        { IP_ERM_0_BASE, IP_ERM_1_BASE }
/** Array initializer of ERM peripheral base pointers */
#define IP_ERM_BASE_PTRS                         { IP_ERM_0, IP_ERM_1 }

/* ----------------------------------------------------------------------------
   -- ERM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ERM_Register_Masks ERM Register Masks
 * @{
 */

/*! @name CR0 - ERM Configuration Register 0 */
/*! @{ */

