rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_ERM.h
#define ERM_EAR21_EAR_MASK                       (0xFFFFFFFFU)
#define ERM_EAR21_EAR_SHIFT                      (0U)
#define ERM_EAR21_EAR_WIDTH                      (32U)
#define ERM_EAR21_EAR(x)                         (((uint32_t)(((uint32_t)(x)) << ERM_EAR21_EAR_SHIFT)) & ERM_EAR21_EAR_MASK)
/*! @} */

/*! @name SYN21 - ERM Memory 21 Syndrome Register */
/*! @{ */

#define ERM_SYN21_SYNDROME_MASK                  (0xFF000000U)
#define ERM_SYN21_SYNDROME_SHIFT                 (24U)
#define ERM_SYN21_SYNDROME_WIDTH                 (8U)
#define ERM_SYN21_SYNDROME(x)                    (((uint32_t)(((uint32_t)(x)) << ERM_SYN21_SYNDROME_SHIFT)) & ERM_SYN21_SYNDROME_MASK)
/*! @} */

/*! @name CORR_ERR_CNT21 - ERM Memory 21 Correctable Error Count Register */
/*! @{ */

#define ERM_CORR_ERR_CNT21_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT21_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT21_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT21_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT21_COUNT_SHIFT)) & ERM_CORR_ERR_CNT21_COUNT_MASK)
/*! @} */

/*! @name EAR22 - ERM Memory 22 Error Address Register */
/*! @{ */

#define ERM_EAR22_EAR_MASK                       (0xFFFFFFFFU)
#define ERM_EAR22_EAR_SHIFT                      (0U)
#define ERM_EAR22_EAR_WIDTH                      (32U)
#define ERM_EAR22_EAR(x)                         (((uint32_t)(((uint32_t)(x)) << ERM_EAR22_EAR_SHIFT)) & ERM_EAR22_EAR_MASK)
/*! @} */

/*! @name SYN22 - ERM Memory 22 Syndrome Register */
/*! @{ */

#define ERM_SYN22_SYNDROME_MASK                  (0xFF000000U)
#define ERM_SYN22_SYNDROME_SHIFT                 (24U)
#define ERM_SYN22_SYNDROME_WIDTH                 (8U)
#define ERM_SYN22_SYNDROME(x)                    (((uint32_t)(((uint32_t)(x)) << ERM_SYN22_SYNDROME_SHIFT)) & ERM_SYN22_SYNDROME_MASK)
/*! @} */

/*! @name CORR_ERR_CNT22 - ERM Memory 22 Correctable Error Count Register */
/*! @{ */

#define ERM_CORR_ERR_CNT22_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT22_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT22_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT22_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT22_COUNT_SHIFT)) & ERM_CORR_ERR_CNT22_COUNT_MASK)
/*! @} */

/*! @name EAR23 - ERM Memory 23 Error Address Register */
/*! @{ */

#define ERM_EAR23_EAR_MASK                       (0xFFFFFFFFU)
#define ERM_EAR23_EAR_SHIFT                      (0U)
#define ERM_EAR23_EAR_WIDTH                      (32U)
#define ERM_EAR23_EAR(x)                         (((uint32_t)(((uint32_t)(x)) << ERM_EAR23_EAR_SHIFT)) & ERM_EAR23_EAR_MASK)
/*! @} */

/*! @name SYN23 - ERM Memory 23 Syndrome Register */
/*! @{ */

#define ERM_SYN23_SYNDROME_MASK                  (0xFF000000U)
#define ERM_SYN23_SYNDROME_SHIFT                 (24U)
#define ERM_SYN23_SYNDROME_WIDTH                 (8U)
#define ERM_SYN23_SYNDROME(x)                    (((uint32_t)(((uint32_t)(x)) << ERM_SYN23_SYNDROME_SHIFT)) & ERM_SYN23_SYNDROME_MASK)
/*! @} */

/*! @name CORR_ERR_CNT23 - ERM Memory 23 Correctable Error Count Register */
/*! @{ */

#define ERM_CORR_ERR_CNT23_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT23_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT23_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT23_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT23_COUNT_SHIFT)) & ERM_CORR_ERR_CNT23_COUNT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ERM_Register_Masks */

/*!
 * @}
 */ /* end of group ERM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K37_ERM_H_) */
